In [39]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt

In [40]:
air=pd.read_csv('air1908.csv')

In [41]:
air.head() #find out the basic information about air1908 dataset

,Date,Time,Location,Operator,Flight #,Route,Type,Registration,cn/In,Aboard,Fatalities,Ground,Summary
0,09/17/1908,17:18,"Fort Myer, Virginia",Military - U.S. Army,NaN,Demonstration,Wright Flyer III,NaN,1,2.0,1.0,0.0,"During a demonstration flight, a U.S. Army fly..."
1,07/12/1912,06:30,"AtlantiCity, New Jersey",Military - U.S. Navy,NaN,Test flight,Dirigible,NaN,NaN,5.0,5.0,0.0,First U.S. dirigible Akron exploded just offsh...
2,08/06/1913,NaN,"Victoria, British Columbia, Canada",Private,-,NaN,Curtiss seaplane,NaN,NaN,1.0,1.0,0.0,The first fatal airplane accident in Canada oc...
3,09/09/1913,18:30,Over the North Sea,Military - German Navy,NaN,NaN,Zeppelin L-1 (airship),NaN,NaN,20.0,14.0,0.0,The airship flew into a thunderstorm and encou...
4,10/17/1913,10:30,"Near Johannisthal, Germany",Military - German Navy,NaN,NaN,Zeppelin L-2 (airship),NaN,NaN,30.0,30.0,0.0,Hydrogen gas which was being vented was sucked...

In [42]:
#the target for this project is find out the highest survival rate in the 1908 dataset
air.Type

#as we can see, there are too many different type of airplane in the dataset

0                       Wright Flyer III
1                              Dirigible
2                       Curtiss seaplane
3                 Zeppelin L-1 (airship)
4                 Zeppelin L-2 (airship)
                      ...
5263             Lockheed C-130 Hercules
5264                       Antonov An-26
5265                     Airbus A330-203
5266    Britten-Norman BN-2A-27 Islander
5267                       Antonov An-32
Name: Type, Length: 5268, dtype: object

In [43]:
#first step is find out that the nan values in the type

In [44]:
(air[['Type','Aboard','Fatalities']].isnull()).sum() #count the nan values in 'type','aboard','fatalities'.

Type          27
Aboard        22
Fatalities    12
dtype: int64

In [45]:
air=air[['Type','Aboard','Fatalities']].dropna()
#clean air dataset by drop all the nan values, prepare the next step analysis

In [46]:
air['Type']=air.Type.map(lambda x:x.split()[0]) 
#this step is use to change 'type' data in order to find out which brand of aircrafts has highest survival rates
#lambda x:x.split()[0] is use to seperate brands from the "type"
#

In [47]:
air #clean dataset

                Type  Aboard  Fatalities
0             Wright     2.0         1.0
1          Dirigible     5.0         5.0
2            Curtiss     1.0         1.0
3           Zeppelin    20.0        14.0
4           Zeppelin    30.0        30.0
...              ...     ...         ...
5263        Lockheed   112.0        98.0
5264         Antonov     4.0         4.0
5265          Airbus   228.0       228.0
5266  Britten-Norman     1.0         1.0
5267         Antonov    13.0        13.0

[5221 rows x 3 columns]

In [48]:
air.Type.value_counts()#we can find out that Douglas and Boeing has highest  accident

Douglas     974
Boeing      371
Lockheed    336
Cessna      289
de          258
           ...
CH-47         1
Channel       1
Ilushin       1
BAe-748       1
Agusta        1
Name: Type, Length: 293, dtype: int64

In [49]:
#I maust say that this analysis is not accuracy and fair beacuse some small brands maufactured few crafts
#in this case, the conclusion is not fair
#in this case, I only use top 5 aircrafts brands

In [50]:
#find out the top 5 brands
top5=air.Type.value_counts()[:5].index

In [51]:
top5

Index(['Douglas', 'Boeing', 'Lockheed', 'Cessna', 'de'], dtype='object')

In [52]:
air=air[air.Type.isin(top5)]
#use boolean query to find out data belongs to the top5 or not
#create a new air dataset which only contains top 5 brands

In [53]:
air

          Type  Aboard  Fatalities
60          de     7.0         7.0
67          de     4.0         4.0
77          de     6.0         6.0
88          de     8.0         8.0
113         de     3.0         3.0
...        ...     ...         ...
5247    Cessna     2.0         2.0
5251    Boeing   134.0         9.0
5260    Cessna    11.0         1.0
5261    Boeing     7.0         7.0
5263  Lockheed   112.0        98.0

[2228 rows x 3 columns]

In [54]:
air.Type.unique() # find out the objects in the 'Type'

array(['de', 'Douglas', 'Boeing', 'Lockheed', 'Cessna'], dtype=object)

In [55]:
np.round((air.Aboard-air.Fatalities)/air.Aboard,2) # round the survival rate at 2 decimal

60      0.00
67      0.00
77      0.00
88      0.00
113     0.00
        ...
5247    0.00
5251    0.93
5260    0.91
5261    0.00
5263    0.12
Length: 2228, dtype: float64

In [56]:
air['survival_rate']=np.round((air.Aboard-air.Fatalities)/air.Aboard,2)

/Users/maojieli/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [63]:
np.round(air.groupby(air['Type']).mean()['survival_rate'],2)

Type
Boeing      0.25
Cessna      0.10
Douglas     0.16
Lockheed    0.11
de          0.21
Name: survival_rate, dtype: float64

In [ ]:
# as we can see the Boeing has highest suvrvial rate based on air1908.csv